////////////////////////////////////////////////////////////////////////////////
// NAME: 			stcom.c
// COMPILER:		Borland C++ 5.0
// AUTHOR:			Klaus P. Gerlicher
// DATE:				4/1997
// DESCRIPTION:
//						decode and execute an 68K opcode
////////////////////////////////////////////////////////////////////////////////
#define STRICT // strict type checking
#define WIN32_LEAN_AND_MEAN  // use only the barest windows API
#include "windows-compat.h" // portable Windows API compatibility layer
#include <stdlib.h>  // include functions LDIV (structure LDIV_T, DV)
							// division operations
#include "STMAIN.H"  // includes of stmain.c
#include "STFLAGS.H" // MC68000 flag functions
#include "STMEM.H"   // memory access
#include "STEACALC.H" // calc effective address
#include "STEXEP.H"   // exception handling
#include "stdll.h"     // header for runtime dynamic linking of plugin modules
#include "ststartw.h"  // startup window header
#include "macros.h"    // macros for CPU status register operations
#include <math.h>

// this macro is the lead-in to every execution function
// and does nothing at the moment
// but could be used in dynamic compiling or debugging
#define CACHEFUNCTION(p)

// opcode jump table created by BUILD.EXE from SKRIPT.TXT
extern void (*Operation[])(short opcode);

////////////////////////////////////////////////////////////////////////////////
// globals
////////////////////////////////////////////////////////////////////////////////
BOOL bStopped=FALSE;	   // set by opcode STOP #XX to indicate
								// a stopped instruction processing
unsigned long nIRQs=0;  // count the occurrance of HW irqs

ULONG hits=0,misses=0;

// pointers to plugin _DLLHDRs
struct tag_DLLHDR* pDllHdr[64];

// structure for event connection between plugin and CPU struct
struct tag_CONN_TO_CPU sConn_to_cpu;


// union for opcode decoding
// divide opcode into bit fields
union
{
		unsigned short o;  // Opcode
		// | 15   14   13   12   11   10   9   8   7   6   5   4   3   2   1   0 |
		// | group             | regdest     | modedest  | modesrc   | regsrc    |
		struct
		{
			unsigned regsrc   : 3;   // 0x0007
			unsigned modesrc  : 3;   // 0x0038
			unsigned modedest : 3;   // 0x01C0
			unsigned regdest  : 3;   // 0x0E00
			unsigned group    : 4;   // 0xF000
		}general;
		struct
		{
			unsigned regsrc   : 3;   // 0x0007
			unsigned modesrc  : 3;   // 0x0038
			unsigned size     : 2;   // 0x00C0
			unsigned reserved : 4;   // 0x0F00
			unsigned group    : 4;   // 0xF000
		}special;
}of; // Opcode

// CPU structure
// the virtual CPUs register set
CPU cpu;

// internal working registers
struct tag_work
{
	long source,destination,result;
}work;

long savepc,spc;  // Temporary PC

long pcbefore; // PC before instruction
char AddressError=0;

// EA calculation function pointer array
long (*CommandMode[8])(char reg,char command,long destination,char size)=
		{DRD,ARD,ARI,ARIPI,ARIPD,ARID,ARII,MISC};

////////////////////////////////////////////////////////////////////////////////
// NAME:          void COM_[name](short opcode);
//
// DESCRIPTION:   execution functions for CPU core
// 					the following functions have one definition in common:
// 					their parameter always is:  short opcode:
//
////////////////////////////////////////////////////////////////////////////////


////////////////////////////////////////////////////////////////////////////////
// DESCRIPTION:	OR immediate to EA
